import React from "react"
import PropTypes from "prop-types"
import Img from "gatsby-image"
import Container from "react-bootstrap/Container"
import Row from "react-bootstrap/Row"
import Col from "react-bootstrap/Col"

const find = (edges, name) => edges.find(edge => edge.node.name === name)

const Story = ({ images }) => (
  <Container as="section">
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-1").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          «من دوباره حالم اونطوری شده» اینو خیلی آروم پشت تلفن گفتم.</p>
        <p>
          احساس خفگی تو هوا موج میزد. نمی تونستم باور کنم دوباره درگیر این
          احساس‌ها شدم.
        </p>
        <p>
          آروم نفس بکش،‌ من خیلی زود میرسم،‌ بابام با آرامش اینا رو گفت تو دفتر
          مدرسه تنها نشستم. می تونستم احساس دل آشوبه و اشک‌هایی که چشمام رو پر
          کرده بود احساس کنم با خودم گفتم زندگی منصفانه نیست.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-2").node.childImageSharp.fluid}
        />
        <Img
          className="content-image"
          fluid={find(images.edges, "story-3").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          با سپری شدن روزها، هفته و ماه ها، کم کم یاد گرفتم که اختلال دوقطبی یک
          بیماری روانپزشکیه که شامل دوره های مانیا و افسردگی میشه.
        </p>
        <p>من فهمیدم که خلقم می‌تونه از حالت خیلی سرخوش به غمگینی شدید برسه.</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-4").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          اولش که بیماریم تشخیص داده شد، خیلی سردرگم بودم و احساس ناامنی شدید
          می‌کردم.
        </p>
        <p>
          حتی دیگران و خانواده ام رو با رفتارها و واکنش هام آزار می دادم. اونقدر
          روحیه ام بی ثبات بود که حتی یک روز کامل نمی تونستم تو مدرسه قرار
          بگیرم.
        </p>
        <p>
          اون سال بدترین 365 روز زندگیم بود. برام باور کردنی نبود و نمی تونستم
          خودم رو در اون وضعیت جمع و جور کنم.
        </p>
        <p>
          احساس می‌کردم سوار یه ترن هوایی ام که توقف نداره و بالا و پایین رفتن
          هاش هیچ لذتی برام نداشت.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-5").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          من می‌دونستم که نمی‌تونم بیماریم رو عوض کنم و مجبور بودم با دوقطبی دست
          و پنجه نرم کنم، پس رو صورتم یه ماسک گذاشتم.
        </p>
        <p>
          هر روز تو مدرسه وانمود می‌کردم که کاملا خوبم ولی در درون احساس می‌کردم
          کلمه ها دارن بهم چنگ میندازن و فشارها خیلی بیشتر از توانم بود.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-6").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          خوشبختانه، بعد از چند سال الان من یه تیم دارم، که شامل والدینم،
          برادرم، روانپزشک و روانشناسم می‌شه.
        </p>
        <p>
          با این تیم من روش‌های مقابله با بیماریم رو یاد گرفتم، مثلا یاد گرفتم
          به موسیقی آرام بخش گوش بدم یا احساسات وحشتناکم رو یادداشت کنم.
        </p>
        <p>
          اگرچه به خاطر برداشت اشتباه جامعه در مورد بیماریم، ترجیح دادم رازم رو
          در محدوده خانواده‌ام حفظ کنم.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-7").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          اختلال دوقطبی خیلی پیچیده‌ ست. خیلی از مردم اصلا با این بیماری آشنا
          نیستن. به عنوان یه نوجوان مبتلا به دوقطبی زندگی من متفاوت از سایر
          آدم‌هاست.
        </p>
        <p>
          من هیجان‌ها رو خیلی قوی‌تر از بیشتر آدم ها احساس می‌کنم. گاهی فکرهام
          با هم مسابقه میذارن. گاهی نمی‌تونم سرعت فکرهام رو کنترل کنم و فقط به
          یه موضوع فکر کنم.
        </p>
        <p>
          من استعداد خوبی در خوندن، نوشتن و رقص دارم و از خلاقیتم برای جهت دادن
          به احساساتم استفاده می کنم.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-8").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          گاهی دوست شدن برام خیلی کار سختیه چون خیلی با بقیه فرق دارم. بقیه فکر
          می‌کنن مغرورم که ارتباط برقرار نمی کنم. من اونقدر در مورد خودم و
          برداشت بقیه نگران می‌شم که وقت برای دوستی کم میارم.
        </p>
        <p>
          واقعا دلم نمی‌خواد اینطور رفتار کنم،‌ ولی فکر می‌کنم اینم یکی از معایب
          بیماریم باشه. من نه تنها با احساساتم مشکل دارم بلکه در تکالیف مدرسه هم
          مشکل دارم.
        </p>
        <p>
          موندن تو مدرسه خیلی سخته به خصوص که دوستی ندارم و نیاز دارم که با یه
          نفر در ارتباط باشم.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-9").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          تمرکز کردن برام خیلی کار سختیه چون احساسات آزاردهنده‌ای دارم که حواسم
          رو پرت می کنن. مثلا خیلی روزها غمگینی شدیدی سراغم میاد و کلاس رو با
          گریه ترک می‌کنم.
        </p>
        <p>
          این‌جور وقت‌ها نمی‌تونم به بچه های دیگه نگاه کنم چون می‌ترسم که
          مسخره‌ام کنن. گاهی آرزو می‌کنم کاش یه چاله رو زمین باز بشه و منو پنهان
          کنه.
        </p>
        <p>
          با این وجود خوشبختانه من اراده ای دارم که بهم کمک می کنه ادامه بدم و
          مقاومتی که هر روز قوی‌ترم می‌کنه.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-10").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          اغلب نوجوان ها زندگی عادیشون رو دارن و از اون لذت می برن. در حالی که
          من با داروها،‌ دل درد، اضطراب، تشنگی بی وقفه، آزمایش خون، ساعت خواب و
          ملاقات با دکتر سر و کار دارم.
        </p>
        <p>
          برعکس یه بیماری مثل سرطان، دوقطبی شناخته شده و مورد حمایت نیست. سرطان
          یه بیماری دردناکه ولی در کنارت آدم‌هایی که دوستت دارن و حمایتت می کنن
          هستن تا بیماریت رو شکست بدی. در حالی که در مورد دوقطبی برداشت های
          اشتباه وجود داره و پذیرفته شده نیست.
        </p>
        <p>
          مردم درک نمی‌کنن چقدر سخته به سبکی زندگی کنی که دوستش نداری و خیلی ها
          تمایلی هم ندارن یاد بگیرن. غم انگیزه که با فرد مبتلا به دوقطبی مثل
          دشمن رفتار میشه و نه بیمار.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <Img
          className="content-image"
          fluid={find(images.edges, "story-11").node.childImageSharp.fluid}
        />
      </Col>
      <Col>
        <p>
          بعد از همه آنچه تجربه کردم و هنوز دارم تجربه می‌کنم، بالاخره نظرم رو
          در مورد دوقطبی تغییر دادم.
        </p>
        <p>
          اولش تمایل شدیدی داشتم که همه چیز رو ول کنم اما بعد سه سال، خوشحالم که
          تشخیص گرفتم. با وجود سختی های خیلی زیادش، فهمیدم که اختلال دوقطبی من
          رو تبدبل به آدم قوی تری کرده.
        </p>
        <p>
          الان میدونم که توانایی تحمل چالش های زندگی رو دارم و امیدوارم یه روز
          بتونم با تجربیاتم به بقیه کمک کنم. من خوشحالم که بیماریم باعث شده
          رویاهام رو رها نکنم. من هیچ وقت اجازه نمیدم دوقطبی شکستم بده.
        </p>
      </Col>
    </Row>
  </Container>
)

Story.propTypes = {
  images: PropTypes.arrayOf(PropTypes.object),
}
export default Story
